;; -*- no-byte-compile: t; -*-
;;; .doom.d/packages.el

;;; Examples:
;; (disable-packages! anaconda-mode
                   ;; company-anaconda)
;; (package! some-package)
;; (package! another-package :recipe (:host github :repo "username/repo"))
;; (package! builtin-package :disable t)
;; (package! elpy)
(package! py-autopep8)
(package! blacken)
;; (package! company-jedi)
;; (package! jedi-core)
;; (package! company-quickhelp :disable t)
(package! org-super-agenda)
(package! matlab-mode)
(package! evil-matchit)
(package! pandoc-mode)
(package! company-box)
(package! posframe)
